app/controllers/posts_controller.rb

INSERT INTO `posts` (`title`, `updated_at`, `created_at`, `body`) VALUES('Soemthinkgnsdkfjasl', '2016-10-26 10:06:20', '2016-10-26 10:06:20', 'sdfjasflkjaslfjafasdjkl')
---
  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save